Autodesk.Revit.DB.BuiltInFailures.TextFailures.ModeltextIsEmpty
Model Text deleted because it consists entirely of spaces and/or carriage returns.

Autodesk.Revit.DB.BuiltInFailures.TextFailures.CannotCreateModeltext
Can't create Model Text.

Autodesk.Revit.DB.BuiltInFailures.TextFailures
Failures about Text.